In [27]:
import pandas as pd

depending variable will be at last and IS what is we're going to predict.

In [28]:
df = pd.read_csv("Titanic-Dataset.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [29]:
df = df.drop_duplicates()

In [30]:
df = df.drop(columns= ["Embarked", "PassengerId", "Name", "Ticket", "Pclass", "Parch", "Fare", "SibSp", "Cabin"])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Sex       891 non-null    object
 2   Age       714 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 21.0+ KB

In [31]:
print(df.isnull().sum())

Survived      0
Sex           0
Age         177
dtype: int64

In [32]:
# print(df["Age"].mean())

In [33]:
# print(df["Age"].median())

In [34]:
# Check missing
print("Before:", df['Age'].isnull().sum())

Before: 177

In [36]:
df["Age"] = df.groupby("Sex")["Age"].transform(lambda x: x.fillna(x.median()))

In [37]:
# Check again
print("After:", df['Age'].isnull().sum())

After: 0

In [38]:
print(df.isnull().sum())

Survived    0
Sex         0
Age         0
dtype: int64

In [39]:
df = df[[c for c in df.columns if c != 'Survived'] + ['Survived']]
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sex       891 non-null    object
 1   Age       891 non-null    float64
 2   Survived  891 non-null    int64
dtypes: float64(1), int64(1), object(1)
memory usage: 21.0+ KB

In [40]:
df["Age"] = df["Age"].bfill()

In [41]:
df.to_csv("cleaned_data.csv", index=False)